STMicroelectronics/STM32CubeL4/Drivers/BSP/STM32L4P5G-Discovery/stm32l4p5g_discovery_psram.c
/**
  ******************************************************************************
  * @file    stm32l4p5g_discovery_psram.c
  * @author  MCD Application Team
  * @brief   This file includes the PSRAM driver for the Octal PSRAM APS6408L-3OB-BA
  *          memory device mounted on STM32L4P5G_DISCOVERY boards.
  @verbatim
  How To use this driver:
  -----------------------
   - This driver is used to drive the APS6408L-3OB-BA external memory mounted
     on STM32L4P5G discovery board.
   - This driver does not need a specific component driver for the PSRAM device
     to be included with.

  Driver description:
  ------------------
  + Initialization steps:
     o Initialize the PSRAM external memory using the BSP_PSRAM_Init() function. This
       function includes the MSP layer hardware resources initialization and the
       OCTOSPI controller configuration to interface with the external PSRAM memory.

  + PSRAM read/write operations
     o PSRAM external memory can be accessed with read/write operations once it is
       initialized.
       Read/write operation can be performed with AHB access using the functions
       BSP_PSRAM_ReadData()/BSP_PSRAM_WriteData() in polling mode,
       BSP_PSRAM_ReadData_IT()/BSP_PSRAM_WriteData_IT() in interrupt mode,
       or by DMA transfer using the functions
       BSP_PSRAM_ReadData_DMA()/BSP_PSRAM_WriteData_DMA().
     o The AHB access is performed with 18-bit width transaction, the DMA transfer
       configuration is fixed at single (no burst) byte transfer.
     o User can implement his own functions for read/write access with his desired
       configurations.
     o Ior transfer in DMA mode, the function BSP_PSRAM_DMA_IRQHandler()
       is called in IRQ handler file, to serve the generated interrupt once the DMA
       transfer is complete.
     o Ior transfer in interrupt mode, the function BSP_PSRAM_OSPI_IRQHandler()
       is called in IRQ handler file, to serve the generated interrupt once the
       transfer is complete.
  @endverbatim
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include "stm32l4p5g_discovery_psram.h"
#include "stm32l4p5g_discovery_io.h"

/** @addtogroup BSP
  * @{
  */

/** @addtogroup STM32L4P5G_DISCOVERY
  * @{
  */

/** @defgroup STM32L4P5G_DISCOVERY_PSRAM STM32L4P5G_DISCOVERY PSRAM
  * @{
  */

/** @defgroup STM32L4P5G_DISCOVERY_PSRAM_Private_Defines Private Defines
  * @{
  */

#define OSPI_P1_CS_PIN                   GPIO_PIN_11
#define OSPI_P1_CLK_PIN                  GPIO_PIN_10
#define OSPI_P1_NCLK_PIN                 GPIO_PIN_9
#define OSPI_P1_D0_PIN                   GPIO_PIN_12
#define OSPI_P1_D1_PIN                   GPIO_PIN_13
#define OSPI_P1_D2_PIN                   GPIO_PIN_7
#define OSPI_P1_D3_PIN                   GPIO_PIN_6
#define OSPI_P1_D4_PIN                   GPIO_PIN_4
#define OSPI_P1_D5_PIN                   GPIO_PIN_5
#define OSPI_P1_D6_PIN                   GPIO_PIN_3
#define OSPI_P1_D7_PIN                   GPIO_PIN_7
#define OSPI_P1_DQS_PIN                  GPIO_PIN_6

#define OSPI_P2_CS_PIN                   GPIO_PIN_12
#define OSPI_P2_CLK_PIN                  GPIO_PIN_4
#define OSPI_P2_NCLK_PIN                 GPIO_PIN_5
#define OSPI_P2_D0_PIN                   GPIO_PIN_0
#define OSPI_P2_D1_PIN                   GPIO_PIN_1
#define OSPI_P2_D2_PIN                   GPIO_PIN_2
#define OSPI_P2_D3_PIN                   GPIO_PIN_3
#define OSPI_P2_D4_PIN                   GPIO_PIN_0
#define OSPI_P2_D5_PIN                   GPIO_PIN_1
#define OSPI_P2_D6_PIN                   GPIO_PIN_9
#define OSPI_P2_D7_PIN                   GPIO_PIN_10
#define OSPI_P2_DQS_PIN                  GPIO_PIN_12

#define OSPI_P1_CS_GPIO_PORT             GPIOE
#define OSPI_P1_CLK_GPIO_PORT            GPIOE
#define OSPI_P1_NCLK_GPIO_PORT           GPIOE
#define OSPI_P1_D0_GPIO_PORT             GPIOE
#define OSPI_P1_D1_GPIO_PORT             GPIOE
#define OSPI_P1_D2_GPIO_PORT             GPIOA
#define OSPI_P1_D3_GPIO_PORT             GPIOA
#define OSPI_P1_D4_GPIO_PORT             GPIOD
#define OSPI_P1_D5_GPIO_PORT             GPIOD
#define OSPI_P1_D6_GPIO_PORT             GPIOC
#define OSPI_P1_D7_GPIO_PORT             GPIOD
#define OSPI_P1_DQS_GPIO_PORT            GPIOG

#define OSPI_P2_CS_GPIO_PORT             GPIOG
#define OSPI_P2_CLK_GPIO_PORT            GPIOF
#define OSPI_P2_NCLK_GPIO_PORT           GPIOF
#define OSPI_P2_D0_GPIO_PORT             GPIOF
#define OSPI_P2_D1_GPIO_PORT             GPIOF
#define OSPI_P2_D2_GPIO_PORT             GPIOF
#define OSPI_P2_D3_GPIO_PORT             GPIOF
#define OSPI_P2_D4_GPIO_PORT             GPIOG
#define OSPI_P2_D5_GPIO_PORT             GPIOG
#define OSPI_P2_D6_GPIO_PORT             GPIOG
#define OSPI_P2_D7_GPIO_PORT             GPIOG
#define OSPI_P2_DQS_GPIO_PORT            GPIOF

/**
  * @}
  */

/** @defgroup STM32L4P5G_DISCOVERY_PSRAM_Private_Macros Private Macros
  * @{
  */
#define OSPI_P1_CS_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOE_CLK_ENABLE()
#define OSPI_P1_CLK_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOE_CLK_ENABLE()
#define OSPI_P1_NCLK_GPIO_CLK_ENABLE()   __HAL_RCC_GPIOE_CLK_ENABLE()
#define OSPI_P1_D0_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOE_CLK_ENABLE()
#define OSPI_P1_D1_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOE_CLK_ENABLE()
#define OSPI_P1_D2_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
#define OSPI_P1_D3_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOA_CLK_ENABLE()
#define OSPI_P1_D4_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOD_CLK_ENABLE()
#define OSPI_P1_D5_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOD_CLK_ENABLE()
#define OSPI_P1_D6_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOC_CLK_ENABLE()
#define OSPI_P1_D7_GPIO_CLK_ENABLE()     __HAL_RCC_GPIOD_CLK_ENABLE()
#define OSPI_P1_DQS_GPIO_CLK_ENABLE()    __HAL_RCC_GPIOG_CLK_ENABLE()

